'''
N x M 체스판
[[-2, 1], [-1, 2], [1, 2], [2, 1]] 로만 이동 가능
방문한 칸의 수 최대

1 0 0 0 0  N = 1  -> 이동x

0 0 1 0 0  N = 2 -> [1, 2], [-1, 2]으로만 이동 가능
1 0 0 0 1  cnt = 3  : (M-1)//2 + 1  시작점 이후부터 2씩 이동

0 1 0 0 0  M = 5 -> 모든 방향 가능(한번씩 이동)
0 0 0 0 1
1 0 1 0 0  cnt = 3

0 0 0 0 0  M = 5
0 1 0 0 0
0 0 0 0 1
1 0 1 0 0  cnt = 4

0 0 0 0 0 0  M = 6
0 0 0 0 0 1
0 0 1 0 0 0
1 0 0 0 1 0 cnt = 4

0 0 0 0 0 0 0  M = 7
0 0 0 0 0 0 0
0 1 0 0 0 0 0
0 0 0 0 1 0 0
1 0 1 0 0 0 1  cnt = 5

0 0 0 0 0 0 0  0  M = 8
0 1 0 0 0 0 0  1
0 0 0 0 1 0 0  0
1 0 1 0 0 0 1' 0  cnt = 6
'''
import sys

N, M = map(int, sys.stdin.readline().split())

if N == 1:
    print(1)

elif N == 2:
    print(min(4, (M-1)//2 + 1))

elif M <= 6:
    print(min(4, M))

else:
    print(M-2)